const text = document.querySelector(".text");
const textList = [
"有那么模糊一刻，他心头忽然涌起一阵古怪的感觉：",
"他并非独自一人在驾驶舱内，身后还有一人。",
"尽管这绝无可能，而且他也马上丢掉这个念头，但这感觉却越来越强烈。",
"此人的呼吸暴露了他的存在。",
"终于，幻觉让他变得无比紧张，以至于有意屏住呼吸",
"（他坚信这是幻觉，并理智地认为，",
"导致这幻觉的根本原因是单调的无线电信号持续在耳边响起而引发的疲倦）。",
"另外那位发出一声长叹。这不可能是幻觉。",
"帕韦斯十分震惊，甚至打了个趔趄，让巨像蹒跚起来。",
"转眼间，指示灯闪烁不停，涡轮发出巨吼，",
"他控制住局势，让机体慢慢停稳。",
"另一位停住呼吸。也许说到底，只是迪格拉机械井中发出的回声？",
"他保持不动，四下张望，",
"忽然在无尽雪床之上看到白色地平线上有个黑色标记，如同墨汁画下的惊叹号。",
"不过光线不足以看清地平线上到底是一堆白云，还是一堆随风荡漾的飘浮物。",
"虽然从未在冬天隔着一英里距离遥望过步行机，他仍确信那就是帕克斯。",
"他朝帕克斯的方向跑去，不由自主地开始加速，丝毫不在意耳机中越来越响的警报音。",
"黑色标记和他一样，在白色背景上快速移动和摇摆着，已能看出轮廓。",
"15分钟后，它的比例越发明显，是另一台迪格拉无疑。",
"他们之间相隔约半英里，",
"或许更远一点。",
"帕韦斯为什么不用发报机向对方呼叫？",
"不知道为什么，也许他隐隐有些害怕。",
"仔细看，甚至看得到对方微小的窗玻璃，",
"巨像的心脏里有个极小的人悬浮着，像是提线木那样舞动身体。",
"帕韦斯紧跟着他，两人身后都溅起羽毛状雪粉，",
"犹如行驶在海中的船舶，拖着长长的泡沫浪迹。",
"帕韦斯急奔，想要超过对方，与此同时，他忽然意识到他们前方有事发生。",
"不远处，一团厚重的白色雪暴正在狂舞、荡漾。它的弯弧闪亮，比白雪更甚。",
"这儿曾是冷间歇泉区域。帕韦斯马上发出呼叫，",
"一次、",
"两次、",
"三次，",
"但他追逐的那位却丝毫没有回应的意思，反而提速了，像是要故意躲开来营救的人。",
"帕韦斯只能效仿，强有力的双臂挥舞不止，向近旁的危险地带加速前冲，",
"整个机体因而晃得更加厉害。速度计颤抖，指向红色极限数值：每小时48英里。",
"帕韦斯大声喊着、嘶吼着，忽然间，声音全咽了下去——",
"那不远处的黑色人体转眼变得宽大、膨胀、拉长，轮廓变得十分模糊。",
"原先眼中有人驾驶的迪格拉，现在成了弥漫在无定形大斑点中的巨大阴影，然后彻底消失了。",
"他孤身一人。到头来，他在追逐自己。"
];

let index = 0;
let it = 0;
let swich = true;

setInterval(function(){
    if (swich){
        text.innerHTML = textList[it].slice(0, ++index);
    }
    else{
        text.innerHTML = textList[it].slice(0, index--);
    }
    if (index == textList[it].length+3){
        swich = false;
    }
    else if (index < 0){
        index = 0;
        swich = true;
        it++;
        if (it >= textList.length){
            it = 0;
        }
    }
},150)